#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = false
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://bchealth--edrddata01.sandbox.my.salesforce.com/*",
        ]
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EDRD.keycloak_openid_user_client_role_protocol_mapper.client_role_mapper will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "client_role_mapper" {
      + add_to_access_token         = true
      + add_to_id_token             = true
      + add_to_userinfo             = true
      + claim_name                  = "roles"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "EDRD"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "client roles"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.EDRD.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "4972d3e8-1c2e-4886-b066-02e2fc43cb2c"
        name                                       = "EDRD"
      ~ valid_redirect_uris                        = [
          - "https://bchealth--edrduat.sandbox.my.salesforce.com/*",
            # (4 unchanged elements hidden)
        ]
        # (24 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.EDRD-PORTAL.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "ec28ad26-876d-4f72-aeb7-3b7932a43c26"
        name                                       = "EDRD-PORTAL"
      ~ valid_redirect_uris                        = [
          - "https://bchealth--edrddata01.sandbox.my.salesforce.com/*",
          - "https://bchealth--edrduat.sandbox.my.site.com/*",
            # (3 unchanged elements hidden)
        ]
        # (24 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EDRD.module.client-roles.keycloak_role.ROLES["EDRD_MoH_Staff"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "EDRD_MoH_Staff"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EDRD.module.client-roles.keycloak_role.ROLES["EDRD_PHSA_PSP_Staff"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "EDRD_PHSA_PSP_Staff"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EDRD.module.client-roles.keycloak_role.ROLES["EDRD_Physicians"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "EDRD_Physicians"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EDRD.module.client-roles.keycloak_role.ROLES["EDRD_Super_Users"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "EDRD_Super_Users"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.SA-SFDC.module.payara-client.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
      + exclude_session_state_from_auth_response   = false
        id                                         = "2624911e-5a46-4378-bae8-ed7fd560ef20"
        name                                       = "Special Authority"
      ~ valid_redirect_uris                        = [
          + "https://bchealth--edrddata01.sandbox.my.salesforce.com/*",
            # (1 unchanged element hidden)
        ]
        # (22 unchanged attributes hidden)
    }

Plan: 6 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*